; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 l5 
          c0 c1 c2 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(location l5)
(car c0)
(car c1)
(car c2)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l0 l5)
(not-eq l5 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l1 l5)
(not-eq l5 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l2 l5)
(not-eq l5 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(not-eq l3 l5)
(not-eq l5 l3)
(not-eq l4 l5)
(not-eq l5 l4)
(empty-ferry)
(at c0 l3)
(at c1 l0)
(at c2 l0)
(at-ferry l0)
)
(:goal
(and
(at c0 l5)
(at c1 l3)
(at c2 l5)
)
)

(:constraints
  (and
    (sometime-before  (at c0 l5) (at-ferry l1))
    (sometime-before  (at c1 l3) (at-ferry l1))
    (sometime-before  (at c2 l5) (at-ferry l1))
  )
)
)

; plan
1. (board c1 l0)
   deleted: (at c1 l0) (empty-ferry)
   added: (on c1)
   goals met: 0 of 3
2. (sail l0 l5)
   deleted: (at-ferry l0)
   added: (at-ferry l5)
   goals met: 0 of 3
3. (debark c1 l5)
   deleted: (on c1)
   added: (at c1 l5) (empty-ferry)
   goals met: 0 of 3
4. (sail l5 l0)
   deleted: (at-ferry l5)
   added: (at-ferry l0)
   goals met: 0 of 3
5. (board c2 l0)
   deleted: (at c2 l0) (empty-ferry)
   added: (on c2)
   goals met: 0 of 3
6. (sail l0 l1)
   deleted: (at-ferry l0)
   added: (at-ferry l1)
   goals met: 0 of 3
7. (debark c2 l1)
   deleted: (on c2)
   added: (at c2 l1) (empty-ferry)
   goals met: 0 of 3
8. (sail l1 l5)
   deleted: (at-ferry l1)
   added: (at-ferry l5)
   goals met: 0 of 3
9. (board c1 l5)
   deleted: (at c1 l5) (empty-ferry)
   added: (on c1)
   goals met: 0 of 3
10. (sail l5 l3)
   deleted: (at-ferry l5)
   added: (at-ferry l3)
   goals met: 0 of 3
11. (debark c1 l3)
   deleted: (on c1)
   added: (at c1 l3) (empty-ferry)
   goals met: 1 of 3
12. (sail l3 l1)
   deleted: (at-ferry l3)
   added: (at-ferry l1)
   goals met: 1 of 3
13. (board c2 l1)
   deleted: (at c2 l1) (empty-ferry)
   added: (on c2)
   goals met: 1 of 3
14. (sail l1 l5)
   deleted: (at-ferry l1)
   added: (at-ferry l5)
   goals met: 1 of 3
15. (debark c2 l5)
   deleted: (on c2)
   added: (at c2 l5) (empty-ferry)
   goals met: 2 of 3
16. (sail l5 l3)
   deleted: (at-ferry l5)
   added: (at-ferry l3)
   goals met: 2 of 3
17. (board c0 l3)
   deleted: (at c0 l3) (empty-ferry)
   added: (on c0)
   goals met: 2 of 3
18. (sail l3 l5)
   deleted: (at-ferry l3)
   added: (at-ferry l5)
   goals met: 2 of 3
19. (debark c0 l5)
   deleted: (on c0)
   added: (at c0 l5) (empty-ferry)
   goals met: 3 of 3
